W8D1/Inclass/reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(subs_params)
        @sub.user_id = current_user.id
        if @sub.save
---
INSERT INTO "subs" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hot"], ["content", "cold"], ["user_id", 1], ["created_at", "2020-12-14 20:12:46.326150"], ["updated_at", "2020-12-14 20:12:46.326150"]]

    def update
        @sub = Sub.find_by(id:params[:id])
        if @sub && @sub.update(subs_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "cold"], ["content", "hot"], ["updated_at", "2020-12-14 20:13:08.229002"], ["id", 4]]