W6D5/Inclass/ninety_nine_cats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "birth_date" = $2, "color" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["name", "Garfield with sex change"], ["birth_date", "2020-12-02"], ["color", "black"], ["sex", "F"], ["description", "fat lady\r\n    "], ["updated_at", "2020-12-04 20:43:01.815350"], ["id", 2]]