W7D2/Inclass/Music_app/app/controllers/albums_controller.rb

    def index
        if params.has_key?(:band_id)
            @albums = Album.where(band_id: params[:band_id])
        else
            @albums = Album.all
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
SELECT "albums".* FROM "albums"