W7D2/Inclass/Music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Big Band!!!"], ["updated_at", "2020-12-08 21:37:43.988216"], ["id", 1]]
---
    def update
        band = Band.find(params[:id])
        if band.update(band_params)