W7D2/Inclass/Music_app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
        <option disabled selected>-- select a band --</option>
        <% Band.all.each do |band| %>